In [17]:
import pandas as pd

In [18]:
data= {
    "name": [ "ajit", "satya","mohan","sohan","rohan"],
    "age": ["20","21","22","23","24"],
    "room":["314","314","000","314","302"],
    "branch":["cse","cse","cm","cse","cv"]
}

In [19]:
print("Semple data")
data

Semple data

{'name': ['ajit', 'satya', 'mohan', 'sohan', 'rohan'],
 'age': ['20', '21', '22', '23', '24'],
 'room': ['314', '314', '000', '314', '302'],
 'branch': ['cse', 'cse', 'cm', 'cse', 'cv']}

In [20]:
df=pd.DataFrame(data)
df

    name age room branch
0   ajit  20  314    cse
1  satya  21  314    cse
2  mohan  22  000     cm
3  sohan  23  314    cse
4  rohan  24  302     cv

In [21]:
print(df.to_string(index=False))

 name age room branch
 ajit  20  314    cse
satya  21  314    cse
mohan  22  000     cm
sohan  23  314    cse
rohan  24  302     cv

In [22]:
name=df["name"]
print(name)

0     ajit
1    satya
2    mohan
3    sohan
4    rohan
Name: name, dtype: object

In [23]:
subset=df[["name", "age"]]
subset

    name age
0   ajit  20
1  satya  21
2  mohan  22
3  sohan  23
4  rohan  24